//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

//a = 5; b = 7 -> max = 7
//a = 2 b = 10 -> max = 10
//a = -9 b = -3 -> max = -3


num 1Console.WriteLine("введите 1 число");
num 2Console.WriteLine("введите 2 число");
string? username = Console.ReadLine();
Console.WriteLine("num 1 + num 2");
Console.WriteLine(username);
